{"version":"0.4","title":"Facilities","type":"page","content":[{"id":"3fd29f46","settings":{"background_background":"classic","background_color":"#FFFFFF","height":"min-height","custom_height":{"unit":"px","size":0,"sizes":[]},"column_position":"stretch"},"elements":[{"id":"2e68e7eb","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"1dd5f6d4","settings":{"carousel":[{"id":343,"url":"https:\/\/0b1.831.myftpupload.com\/wp-content\/uploads\/2021\/01\/magdalene_college_library.jpg"},{"id":181,"url":"https:\/\/0b1.831.myftpupload.com\/wp-content\/uploads\/2021\/01\/wp2468660.jpg"}],"thumbnail_size":"large","slides_to_show":"1","image_stretch":"yes","autoplay_speed":25000},"elements":[],"isInner":false,"widgetType":"image-carousel","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"1f018a0","settings":{"background_background":"classic","background_color":"#FFFFFF"},"elements":[{"id":"5210758c","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"3dcfdd82","settings":{"editor":"<p><\/p>\n<h2><u>Library<\/u><\/h2>\n<p>The university has a spacious central library in an independent building with an area of 1110 Sq.m. spread over two floors. First Floor is accommodating OPAC, periodicals, New Papers, digital library, thesis and Special reference. Second floor is accommodating circulation, References, Periodical back volumes, computer center etc. It is having a modern infrastructure with a seating capacity of 250 students.&nbsp;<span style=\"color: #333333; font-family: Arimo, sans-serif; font-size: 14px;\">It has the collection of 6523 Titles and 37591 volumes of books as on June, 2020. D<\/span><span style=\"color: #333333; font-family: Arimo, sans-serif; font-size: 14px;\">igital library with 100 systems to access E-journals, E-books, E-learning, Multimedia Center and photocopying are made available for the convenience of the users NPTEL facility to access video lectures.&nbsp;<\/span><span style=\"color: #333333; font-family: Arimo, sans-serif; font-size: 14px;\">Library &amp; Information Center provides uncompromising information and intellectual requirements to its students and faculty with user-friendly approach. It offers a fully integrated and dynamic environment for conducting academic study. Library is fully computerized with bar-coding system.<\/span><\/p>","align":"justify","_animation":"fadeInLeft"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"1b28f524","settings":{"background_background":"classic","background_color":"#FFFFFF"},"elements":[{"id":"10ea8ca8","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"60a30c87","settings":{"editor":"<p> <\/p><h2><u>Sports<\/u><\/h2><p><u><\/u><br \/>Technically speaking we offer holistic education. It is a fact to reckon with that, the students while pursuing B.Tech degree are in fact in their teen age. This is the most crucial time period in an individual's life. As an educational institute we have to cater to the moral, spiritual, physical and educational needs of the students. Its wrong on the part of the parents, society and educational institutes only to clamor for academic success alone of the students. Therefore, education should be a tool in enhancing the human qualities in the students. In this regard we have to remember that a sound body restores a sound mind; a sound mind develops a sound character; and a sound character builds a sound personality.<\/p><p style=\"border-color: #e1e1e1; border-style: solid; zoom: 1; -webkit-tap-highlight-color: rgba(0, 0, 0, 0); margin-bottom: 10px; text-align: justify; color: #333333; font-family: Arimo, sans-serif; font-size: 14px; font-style: normal; font-weight: 400; background-color: #ffffff;\">A vast sports outfield at the university offers excellent opportunity for the students to cheer up, have a relaxed outing and simultaneously play sports and games for their physical growth. Students have the facilities for playing football, handball, volleyball, shuttle and many other games. Our teams not only represented the college in various sports meets but also brought laurels to the institute by winning many prizes in various sports meets.<\/p>","align":"justify","_animation":"zoomIn"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"760f45dd","settings":{"background_background":"classic","background_color":"#FFFFFF"},"elements":[{"id":"662313d3","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"4f899b0b","settings":{"editor":"<p><\/p>\n<h2><u>Transport<\/u><\/h2>\n<p><u><\/u>This facility for the students is provided from all corners of the city. Driven by a team of trained drivers 36 buses ply from all places catering to the students need for comfortable and hassle free transport.&nbsp;<span style=\"color: #333333; font-family: Arimo, sans-serif; font-size: 14px;\">The college is situated at Himayat Nagar, which in itself is well connected to all the important regions of the city. Therefore, a good number of TSRTC buses ply to this region frequently. Alongside, college owns sufficient buses to bring the students on time to the college. The unique fact is that the students are taken care of in the buses too by senior faculty members, such that their needs are well attended to even during the journey hours.&nbsp;<\/span><span style=\"color: #333333; font-family: Arimo, sans-serif; font-size: 14px;\">Geethanjali, probably is the only such college, where the transport is provided to the students on no-profit-no-loss basis.For us transport is not a business, only the comfort of the students matter the most for us. Experienced drivers, whose credentials are well proven, are appointed to drive the buses. This gives a sound sleep to the parents at home.<\/span><\/p>","align":"justify","_animation":"fadeInRight"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"}]}